In [2]:
%load_ext sql

In [3]:
%sql mysql+mysqlconnector://root:root@localhost

In [4]:
%sql mysql+mysqlconnector://root:root@localhost/mydb

In [5]:
%%sql
drop table rides

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [6]:
%%sql
CREATE TABLE rides (
    ride_id INT PRIMARY KEY,
    driver_id INT NOT NULL ,
    rider_id INT NOT NULL,
    pickup_location VARCHAR(100) NOT NULL ,
    dropoff_location VARCHAR(100) NOT NULL,
    ride_date DATETIME NOT NULL ,
    fare DECIMAL(10, 2) NOT NULL
);

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [8]:
%%sql
INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(1, 101, 201, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 500.00);

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[]

In [10]:
%%sql
INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(2, 101, 201, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 500.00);

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[]

In [12]:
%%sql
/* 
   PRIMARY KEY Explanation:

   - A Primary Key is a column (or a group of columns) that uniquely 
     identifies each row in a table.

   - It must always be UNIQUE:
       No two rows can have the same primary key value.

   - It must always be NOT NULL:
       Every row must contain a value for the primary key.

   - A table can have only ONE Primary Key constraint, 
     but that key can include multiple columns (composite key).

   - The Primary Key helps maintain data integrity and allows 
     the database to quickly locate specific records.

   - It is automatically indexed by the database for faster search.
*/

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [14]:
%%sql
drop table rides

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [21]:
%%sql

CREATE TABLE rides (
    ride_id INT,
    driver_id INT NOT NULL,
    rider_id INT NOT NULL,
    pickup_location VARCHAR(100) NOT NULL,
    dropoff_location VARCHAR(100) NOT NULL,
    ride_date DATETIME NOT NULL,
    fare DECIMAL(10, 2) NOT NULL,
    PRIMARY KEY (ride_id, rider_id)
);

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [22]:
%%sql
desc rides

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
7 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'NO', '', None, ''),
 ('rider_id', 'int', 'NO', 'PRI', None, ''),
 ('pickup_location', 'varchar(100)', 'NO', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'NO', '', None, ''),
 ('ride_date', 'datetime', 'NO', '', None, ''),
 ('fare', 'decimal(10,2)', 'NO', '', None, '')]

In [27]:
%%sql
INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(2, 101, 202, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 500.00);

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[]

In [28]:
%%sql
select * from rides;

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
3 rows affected.

[(1, 101, 201, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('500.00')),
 (1, 101, 202, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('500.00')),
 (2, 101, 202, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('500.00'))]

In [29]:
%%sql
/* 
   COMPOSITE PRIMARY KEY (ride_id, rider_id) – Explanation:

   - In this rides table, neither ride_id nor rider_id alone can uniquely
     identify a row because both columns contain duplicate values.
         * Example: ride_id = 1 appears multiple times.
         * Example: rider_id = 202 appears multiple times.

   - However, the COMBINATION of (ride_id, rider_id) is always unique.
     This makes them a perfect pair for a composite primary key.

   - This composite key ensures:
       1. No duplicate ride–rider pair can exist.
       2. The correct mapping of which rider booked which ride.
       3. Strong data integrity for ride booking relationships.

   - In real-world ride-sharing databases:
       * A ride can have multiple riders (carpool).
       * A rider can join different rides.
       * So a single-column primary key is not enough.

   - Hence, using PRIMARY KEY (ride_id, rider_id) fits naturally 
     with the structure and meaning of this data.


    GENERAL EXPLNATION 
     
   COMPOSITE PRIMARY KEY EXPLANATION:

   - A composite primary key is created using two or more columns together.
   - These columns, when combined, uniquely identify each row in the table.
   - Individually, each column may contain duplicate values,
     but the combination of values across the key columns must be unique.

   - All columns in a composite primary key are automatically NOT NULL.
   - This ensures data integrity and prevents duplicate or incomplete records.

   - Composite keys are useful when:
       * No single column can uniquely identify a row.
       * The uniqueness depends on a combination of attributes
         (e.g., ride_id + rider_id, order_id + product_id).

   - The database automatically creates an index on the composite key,
     improving search and lookup performance based on these columns.

*/

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [35]:
%%sql
create table users (
    user_id INT primary key,
    email varchar(50) unique
);

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.
0 rows affected.

[]

In [43]:
%%sql
insert into users (user_id, email)
values (1, 'user1@gmail.com');

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '1' for key 'users.PRIMARY'
[SQL: insert into users (user_id, email)
values (1, 'user1@gmail.com');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [48]:
%%sql
insert into users (user_id, email)
values (2, 'user2@gmail.com');

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[]

In [50]:
%%sql
insert into users (user_id, email)
values (3, NULL);

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[]

In [53]:
%%sql
/* Here you cannot able to enter 
%%sql
insert into users (user_id, email)
values (Null, somemail@gmail.com);

Because the Primary key doesnt allow NULL Only UNIQUE allows null 

And you think that the UNIQUE works like composite Primary key but it is not working like that
*/

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [51]:
%%sql 
select * from users;

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
3 rows affected.

[(3, None), (1, 'user@gmail.com'), (2, 'user2@gmail.com')]

In [54]:
%%sql
/* 
   UNIQUE Constraint – Explanation:

   - A UNIQUE constraint ensures that the values in a column 
     (or a group of columns) do not repeat.
     Every value must be different from every other value.

   - Unlike a PRIMARY KEY:
        * UNIQUE allows only one NULL value (in most SQL databases)
        * A table can have multiple UNIQUE constraints
        * PRIMARY KEY = UNIQUE + NOT NULL (stronger rule)

   - UNIQUE is used when:
        * A column should not repeat, but it doesn’t qualify as a primary key.
        * Example: email, phone_number, username, license_number, etc.

   - A UNIQUE constraint helps prevent accidental duplicate entries 
     and maintains clean, reliable data.
*/

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [75]:
%%sql
CREATE TABLE rides (
    ride_id INT,
    driver_id INT NOT NULL,
    rider_id INT,
    pickup_location VARCHAR(100) NOT NULL,
    dropoff_location VARCHAR(100) NOT NULL,
    ride_date DATETIME NOT NULL,
    fare DECIMAL(10, 2) NOT NULL
    );

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.
0 rows affected.

[]

In [76]:
%%sql 
desc rides;

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
7 rows affected.

[('ride_id', 'int', 'YES', '', None, ''),
 ('driver_id', 'int', 'NO', '', None, ''),
 ('rider_id', 'int', 'YES', '', None, ''),
 ('pickup_location', 'varchar(100)', 'NO', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'NO', '', None, ''),
 ('ride_date', 'datetime', 'NO', '', None, ''),
 ('fare', 'decimal(10,2)', 'NO', '', None, '')]

In [77]:
%%sql
INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(NUll, 101, Null, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 500.00);

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[]

In [78]:
%%sql
select * from rides

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[(None, 101, None, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('500.00'))]

In [ ]:
%%sql
/* 
   NOT NULL: Ensures the column must always have a value.
   It prevents empty or missing data in important fields like
   driver_id, pickup_location, dropoff_location, ride_date, and fare.


   GENERAL EXPLANATION 
        
   NOT NULL Constraint:
   - Ensures a column cannot have empty or missing values.
   - Every row must contain a valid value for columns marked NOT NULL.
   - Helps maintain data completeness and prevents accidental NULL entries.
*/

In [79]:
%%sql
CREATE TABLE rides1 (
    ride_id INT PRIMARY KEY,
    driver_id INT NOT NULL,
    rider_id INT,
    pickup_location VARCHAR(100) NOT NULL,
    dropoff_location VARCHAR(100) NOT NULL,
    ride_date DATETIME NOT NULL,
    fare DECIMAL(10, 2) CHECK (fare > 0 ) #check constraints 
    );

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [93]:
%%sql
INSERT INTO rides1 (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(3, 101, 201, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 912.8);
# it cannot be - value, because we gave the conditon above. it works like a where function

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.
0 rows affected.

[]

In [94]:
%%sql
select * from rides1;

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
3 rows affected.

[(1, 101, 201, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('1352.89')),
 (2, 101, 201, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('100.23')),
 (3, 101, 201, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('912.80'))]

In [95]:
%%sql
/* 
   CHECK Constraint:
   - Ensures that values entered in a column satisfy a specific condition.
   - Helps enforce valid and logical data (e.g., fare > 0, age >= 18).
   - Prevents invalid or out-of-range values from being inserted.
*/

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [11]:
%%sql
-- Creating the drivers table

drop table rides2;
drop table drivers;
CREATE TABLE drivers (
    driver_id INT PRIMARY KEY,
    driver_name VARCHAR(100),
    license_number VARCHAR(50) UNIQUE
);

-- Creating the rides table with driver_id as a foreign key
CREATE TABLE rides2 (
    ride_id INT PRIMARY KEY,
    driver_id INT,
    pickup_location VARCHAR(100),
    dropoff_location VARCHAR(100),
    ride_date DATETIME,
    fare DECIMAL(10, 2),
    FOREIGN KEY (driver_id) REFERENCES drivers(driver_id)
);

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [12]:
%%sql
desc drivers;

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
3 rows affected.

[('driver_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_name', 'varchar(100)', 'YES', '', None, ''),
 ('license_number', 'varchar(50)', 'YES', 'UNI', None, '')]

In [13]:
%%sql
desc rides2;

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
6 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'YES', 'MUL', None, ''),
 ('pickup_location', 'varchar(100)', 'YES', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'YES', '', None, ''),
 ('ride_date', 'datetime', 'YES', '', None, ''),
 ('fare', 'decimal(10,2)', 'YES', '', None, '')]

In [14]:
%%sql
INSERT INTO drivers (driver_id, driver_name, license_number)
VALUES
(101, 'John Doe', 'XYZ12345'),
(102, 'Jane Smith', 'ABC67890');

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
2 rows affected.

[]

In [19]:
%%sql
INSERT INTO rides2 (ride_id, driver_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(301, 101, 'Chennai', 'Coimbatore', '2024-12-01 08:00:00', 500.00),
(302, 101, 'Chennai', 'Madurai', '2024-12-01 09:30:00', 600.00),
(303, 102, 'Bangalore', 'Hyderabad', '2024-12-02 10:00:00', 700.00);

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
3 rows affected.

[]

In [20]:
%%sql
# soft delete concept 
alter table rides2 add column is_delete boolean default false

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
(mysql.connector.errors.ProgrammingError) 1060 (42S21): Duplicate column name 'is_delete'
[SQL: # soft delete concept
alter table rides2 add column is_delete boolean default false]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [21]:
%%sql
select * from rides2

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
3 rows affected.

[(301, 101, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 1, 8, 0), Decimal('500.00'), 0),
 (302, 101, 'Chennai', 'Madurai', datetime.datetime(2024, 12, 1, 9, 30), Decimal('600.00'), 0),
 (303, 102, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 2, 10, 0), Decimal('700.00'), 0)]

In [22]:
%%sql
#when you want to delete some data in the table insted of hard delete it you can soft delete it, which means you just mark it as deleated.
update rides2 set is_delete = true where driver_id = 102

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[]

In [24]:
%%sql 
# Now it has been marked in the table, so others who are using the data can understand that this row is deleated for some reasons
select * from rides2

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
3 rows affected.

[(301, 101, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 1, 8, 0), Decimal('500.00'), 0),
 (302, 101, 'Chennai', 'Madurai', datetime.datetime(2024, 12, 1, 9, 30), Decimal('600.00'), 0),
 (303, 102, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 2, 10, 0), Decimal('700.00'), 1)]